.emacs.d/Emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle (file-truename "~/.emacs.d/init.el")

This is an ongoing evolution of my original Emacs configuration files, inspired by
a bunch of resources I've found online.

* Table of Contents
:PROPERTIES:
:TOC:      :include all :depth 2 :force (ignore) :ignore (this) :local (nothing)
:END:
:CONTENTS:
- [[#table-of-contents][Table of Contents]]
- [[#early-init][Early-Init]]
- [[#header][Header]]
- [[#startup-performance][Startup Performance]]
- [[#package-management-with-leaf][Package Management with Leaf]]
  - [[#install-leaf-and-set-leaf-keywords][Install Leaf and Set Leaf-Keywords]]
- [[#keep-emacsd-clean][Keep .emacs.d Clean]]
- [[#general-configuration][General Configuration]]
  - [[#properties-of-builtin][Properties of builtin]]
  - [[#change-modifiers][Change modifiers]]
  - [[#auto-revert-buffer][Auto revert buffer]]
  - [[#auto-saving-changed-files][Auto-Saving Changed Files]]
  - [[#undo-helper][Undo Helper]]
  - [[#native-compilation][Native Compilation]]
- [[#utility-functions][Utility Functions]]
  - [[#toggle-mode-line][Toggle Mode-line]]
  - [[#trim-newline-from-string][Trim newline from string]]
  - [[#sort-sexpresions][Sort Sexpresions]]
  - [[#command-log-mode][Command Log Mode]]
  - [[#presentation][Presentation]]
  - [[#bibtex-indent][Bibtex Indent]]
- [[#basic-ui-configuration][Basic UI Configuration]]
  - [[#user-interface][User Interface]]
  - [[#frame-transparency][Frame Transparency]]
  - [[#font-configuration][Font Configuration]]
  - [[#theme-configuration][Theme Configuration]]
  - [[#modeline-configuration][Modeline Configuration]]
- [[#keyboard-bindings][Keyboard Bindings]]
  - [[#modal-editing-with-meow][Modal Editing with Meow]]
  - [[#keybinding-panel-which-key][Keybinding Panel (which-key)]]
  - [[#transient-commands][Transient Commands]]
- [[#file-browsing][File Browsing]]
  - [[#dired][Dired]]
  - [[#opening-files-externally][Opening Files Externally]]
  - [[#neotree][NeoTree]]
- [[#development][Development]]
  - [[#git][Git]]
  - [[#debugger-with-dap-mode][Debugger with Dap Mode]]
  - [[#projects-management][Projects Management]]
  - [[#language][Language]]
  - [[#productivity][Productivity]]
- [[#window-management][Window Management]]
  - [[#window-history-with-winner-mode][Window History with winner-mode]]
  - [[#window-selection-with-ace-window][Window Selection with ace-window]]
  - [[#window-movement-with-windmove][Window Movement with windmove]]
  - [[#resize-window][Resize Window]]
  - [[#named-window-with-tab-bar][Named Window with tab-bar]]
  - [[#rotate-window-layout][Rotate Window Layout]]
  - [[#set-margins][Set Margins]]
  - [[#control-buffer-placement][Control Buffer Placement]]
- [[#completion-system][Completion System]]
  - [[#duplicate-line-or-selected-regions-with-duplicate-thing][Duplicate line or selected regions with Duplicate-thing]]
  - [[#multiple-cursors][Multiple cursors]]
  - [[#asynchronous-fuzzy-finder-with-affe][Asynchronous Fuzzy Finder with Affe]]
  - [[#completion-actions-with-embark][Completion Actions with Embark]]
  - [[#consult-commands][Consult Commands]]
  - [[#improved-candidate-filtering-with-orderless][Improved Candidate Filtering with Orderless]]
  - [[#completion-annotations-with-marginalia][Completion Annotations with Marginalia]]
  - [[#vertical-minibuffer-ui-and-completion-with-vertico][Vertical Minibuffer UI and Completion with Vertico]]
  - [[#completions-in-regions-with-corfu][Completions in Regions with Corfu]]
  - [[#colorful-icons-for-completion-with-kind-icon][Colorful icons for completion with kind-icon]]
  - [[#front-end-for-citation-with-citar][Front-end for citation with Citar]]
- [[#moving-in-buffer][Moving in buffer]]
  - [[#jumping-with-avy][Jumping with Avy]]
  - [[#jumping-beginningend-of-line-with-mwim][Jumping beginning/end of line with mwim]]
- [[#shell][Shell]]
  - [[#eshell][Eshell]]
  - [[#fish-mode][Fish Mode]]
  - [[#nix-mode][Nix Mode]]
  - [[#vterm-mode][Vterm Mode]]
- [[#runtime-performance][Runtime Performance]]
  - [[#silent-garbage-collection-with-gcmh][Silent Garbage collection with gcmh]]
- [[#org-mode][Org Mode]]
  - [[#org-configuration][Org Configuration]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-babel][Org Babel]]
  - [[#presentations][Presentations]]
  - [[#cross-reference][Cross Reference]]
  - [[#outline-based-notes-management-and-organizer][Outline-based notes management and organizer]]
  - [[#org-roam][Org Roam]]
  - [[#bullets][Bullets]]
  - [[#image-handling][Image Handling]]
  - [[#auto-show-markup-symbols][Auto-show Markup Symbols]]
  - [[#auto-tangle-configuration-files][Auto-tangle Configuration Files]]
  - [[#update-table-of-contents-on-save][Update Table of Contents on Save]]
- [[#latex-mode][LaTeX Mode]]
- [[#applications][Applications]]
  - [[#competitive-programming-with-oj---online-judge][Competitive Programming with oj - Online Judge]]
  - [[#elfeed][Elfeed]]
  - [[#mail][Mail]]
  - [[#notmuch][Notmuch]]
- [[#server-mode][Server Mode]]
- [[#trial-packages][Trial Packages]]
  - [[#web-browser-with-emacs-w3m][Web Browser with emacs-w3m]]
  - [[#tree-sitter][Tree Sitter]]
  - [[#enhance-xwidget-webkit-browser][Enhance xwidget webkit browser]]
  - [[#pdf-tools][PDF Tools]]
  - [[#apple-script-mode][Apple Script Mode]]
  - [[#emacs-jupyter][Emacs Jupyter]]
  - [[#search-in-external-web-browser][Search in external web browser]]
  - [[#emacs-application-framework][Emacs Application Framework]]
  - [[#browse-at-remote][Browse at remote]]
  - [[#org-inline-anim][Org-inline-anim]]
  - [[#save-frame-and-window-configs-with-burly][Save frame and window configs with Burly]]
  - [[#atomic-chrome][Atomic-Chrome]]
  - [[#org-modern][Org-modern]]
  - [[#vertico-posframe][Vertico-posframe]]
  - [[#know-your-http-well][Know Your HTTP Well]]
  - [[#csv-mode][CSV-mode]]
  - [[#markdown-preview-mode][Markdown-preview-mode]]
- [[#footer][Footer]]
:END:

* Early-Init
:PROPERTIES:
:ID:       4A8E2D78-CE01-4769-A784-49956617A4E5
:END:
#+begin_src emacs-lisp :tangle ~/.emacs.d/early-init.el

;;; early-init.el --- Early Initialization. -*- lexical-binding: t no-byte-compile: t -*-
;;; Commentary:
;;
;; Emacs 27 introduces early-init.el, which is run before init.el,
;; before package and UI initialization happens.
;;
;;; Code:

;; Speed up startup
(defvar default-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
(setq gc-cons-threshold most-positive-fixnum)
(add-hook 'emacs-startup-hook
          (lambda ()
            "Restore defalut values after startup."
            (setq file-name-handler-alist default-file-name-handler-alist
                  gc-cons-threshold (* 1024 1024 1024))))

;; basic
(prefer-coding-system 'utf-8)
(set-file-name-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-clipboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-default 'buffer-file-coding-system 'utf-8)
(setq debug-on-error nil
      init-file-debug t
      user-full-name "Naoki Sakamoto"
      user-mail-address "naoki@bbo.cs.tsukuba.ac.jp"
      user-login-name "naoking158"
      package-enable-at-startup nil
      package-native-compile t)

;; (when-let ((fish (executable-find "fish")))
;;   (setq shell-file-name fish))

;; GUI
(setq default-frame-alist '((line-spacing . 2)
                            (vertical-scroll-bars)
                            (menu-bar-lines . 0)
                            (tool-bar-lines . 0)
                            (left-fringe . 10)
                            (right-fringe . 10)
                            (width . 150)
                            (height . 80)))

(setq inhibit-splash-screen t
      frame-inhibit-implied-resize t
      byte-compile-warnings '(cl-functions))

;; Avoid popup Async buffer window
(add-to-list 'display-buffer-alist
             '("^*Async Shell Command*" . (display-buffer-no-window)))

(provide 'early-init)

;;; early-init.el ends here

#+end_src


* Header
:PROPERTIES:
:ID:       875737C6-80FB-4110-B49A-6A330AE8CCB9
:END:

#+begin_src emacs-lisp

;;; init.el --- My init.el  -*- lexical-binding: t; -*-

;;; Commentary:

;; My init.el.

;;; Code:

;; this enables this running method
;;   emacs -q -l ~/.debug.emacs.d/{{pkg}}/init.el

#+end_src

#+RESULTS:


* Startup Performance
:PROPERTIES:
:ID:       B395D503-F0B0-4B02-9500-C8056B6E9C6C
:END:

By setting ~exec-profile~ to ~t~, profiling startup time is executed.

#+begin_src emacs-lisp

(setq exec-profile nil)

(when exec-profile
  (defvar setup-tracker--level 0)
  (defvar setup-tracker--parents nil)
  (defvar setup-tracker--times nil)

  (when load-file-name
    (push load-file-name setup-tracker--parents)
    (push (current-time) setup-tracker--times)
    (setq setup-tracker--level (1+ setup-tracker--level)))

  (add-variable-watcher
   'load-file-name
   (lambda (_ v &rest __)
     (cond ((equal v (car setup-tracker--parents))
            nil)
           ((equal v (cadr setup-tracker--parents))
            (setq setup-tracker--level (1- setup-tracker--level))
            (let* ((now (current-time))
                   (start (pop setup-tracker--times))
                   (elapsed (+ (* (- (nth 1 now) (nth 1 start)) 1000)
                               (/ (- (nth 2 now) (nth 2 start)) 1000))))
              (with-current-buffer (get-buffer-create "*setup-tracker*")
                (save-excursion
                  (goto-char (point-min))
                  (dotimes (_ setup-tracker--level) (insert "> "))
                  (insert
                   (file-name-nondirectory (pop setup-tracker--parents))
                   " (" (number-to-string elapsed) " msec)\n")))))
           (t
            (push v setup-tracker--parents)
            (push (current-time) setup-tracker--times)
            (setq setup-tracker--level (1+ setup-tracker--level))))))


  (defun efs/display-startup-time()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time
                      (time-subtract after-init-time before-init-time)))
             gcs-done))
  (add-hook 'emacs-startup-hook #'efs/display-startup-time))

#+end_src

* Package Management with Leaf
:PROPERTIES:
:ID:       C4215126-C0C1-4BFE-A22B-73E377BD39D1
:END:

** Install Leaf and Set Leaf-Keywords
:PROPERTIES:
:ID:       17DE73BF-514F-4FB2-92F6-5AE76B3D14F1
:END:

#+begin_src emacs-lisp

(prog1 'leaf-setup
  (eval-and-compile
    (custom-set-variables
     '(warning-suppress-types '((comp)))
     '(package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                          ("nongnu" . "https://elpa.nongnu.org/nongnu/")
                          ("melpa" . "https://melpa.org/packages/"))))
    (package-initialize)
    (unless (package-installed-p 'leaf)
      (package-refresh-contents)
      (package-install 'leaf))

    (leaf leaf-keywords
      :ensure t
      :config (leaf-keywords-init)
      :init
      (leaf leaf-convert :ensure t)
      (leaf hydra :ensure t)
      (leaf blackout :ensure t)

      (leaf key-chord
        :ensure t
        :hook (emacs-startup-hook . (lambda () (key-chord-mode 1)))
        :custom ((key-chord-one-keys-delay . 0.02)
                 (key-chord-two-keys-delay . 0.03))
        :config
        (key-chord-define-global "x0" '"\C-x0")
        (key-chord-define-global "x1" '"\C-x1")
        (key-chord-define-global "x2" '"\C-x2")
        (key-chord-define-global "x3" '"\C-x3")
        (key-chord-define-global "x5" '"\C-x52"))

      ;; (leaf straight
      ;;   :config
      ;;   (defvar bootstrap-version)
      ;;   (let ((bootstrap-file
      ;;          (expand-file-name "straight/repos/straight.el/bootstrap.el" "~/.emacs.d/"))
      ;;         (bootstrap-version 5))
      ;;     (unless (file-exists-p bootstrap-file)
      ;;       (with-current-buffer
      ;;           (url-retrieve-synchronously
      ;;            "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
      ;;            'silent 'inhibit-cookies)
      ;;         (goto-char (point-max))
      ;;         (eval-print-last-sexp)))
      ;;     (load bootstrap-file nil 'nomessage)))
      )))

#+end_src

#+RESULTS:
: leaf-setup

